FlandreUNX/emmk-v5.1/hal/swm180x/SWM180_StdPeriph_Driver/SWM180.h
#define IRQMUX_IRQ24_IF_INT0_Pos	0
#define IRQMUX_IRQ24_IF_INT0_Msk	(0x01 << IRQMUX_IRQ24_IF_INT0_Pos)
#define IRQMUX_IRQ24_IF_INT1_Pos	1
#define IRQMUX_IRQ24_IF_INT1_Msk	(0x01 << IRQMUX_IRQ24_IF_INT1_Pos)

#define IRQMUX_IRQ25_IF_INT0_Pos	0
#define IRQMUX_IRQ25_IF_INT0_Msk	(0x01 << IRQMUX_IRQ25_IF_INT0_Pos)
#define IRQMUX_IRQ25_IF_INT1_Pos	1
#define IRQMUX_IRQ25_IF_INT1_Msk	(0x01 << IRQMUX_IRQ25_IF_INT1_Pos)

#define IRQMUX_IRQ26_IF_INT0_Pos	0
#define IRQMUX_IRQ26_IF_INT0_Msk	(0x01 << IRQMUX_IRQ26_IF_INT0_Pos)
#define IRQMUX_IRQ26_IF_INT1_Pos	1
#define IRQMUX_IRQ26_IF_INT1_Msk	(0x01 << IRQMUX_IRQ26_IF_INT1_Pos)

#define IRQMUX_IRQ27_IF_INT0_Pos	0
#define IRQMUX_IRQ27_IF_INT0_Msk	(0x01 << IRQMUX_IRQ27_IF_INT0_Pos)
#define IRQMUX_IRQ27_IF_INT1_Pos	1
#define IRQMUX_IRQ27_IF_INT1_Msk	(0x01 << IRQMUX_IRQ27_IF_INT1_Pos)

#define IRQMUX_IRQ28_IF_INT0_Pos	0
#define IRQMUX_IRQ28_IF_INT0_Msk	(0x01 << IRQMUX_IRQ28_IF_INT0_Pos)
#define IRQMUX_IRQ28_IF_INT1_Pos	1
#define IRQMUX_IRQ28_IF_INT1_Msk	(0x01 << IRQMUX_IRQ28_IF_INT1_Pos)

#define IRQMUX_IRQ29_IF_INT0_Pos	0
#define IRQMUX_IRQ29_IF_INT0_Msk	(0x01 << IRQMUX_IRQ29_IF_INT0_Pos)
#define IRQMUX_IRQ29_IF_INT1_Pos	1
#define IRQMUX_IRQ29_IF_INT1_Msk	(0x01 << IRQMUX_IRQ29_IF_INT1_Pos)

#define IRQMUX_IRQ30_IF_INT0_Pos	0
#define IRQMUX_IRQ30_IF_INT0_Msk	(0x01 << IRQMUX_IRQ30_IF_INT0_Pos)
#define IRQMUX_IRQ30_IF_INT1_Pos	1
#define IRQMUX_IRQ30_IF_INT1_Msk	(0x01 << IRQMUX_IRQ30_IF_INT1_Pos)

#define IRQMUX_IRQ31_IF_INT0_Pos	0
#define IRQMUX_IRQ31_IF_INT0_Msk	(0x01 << IRQMUX_IRQ31_IF_INT0_Pos)
#define IRQMUX_IRQ31_IF_INT1_Pos	1
#define IRQMUX_IRQ31_IF_INT1_Msk	(0x01 << IRQMUX_IRQ31_IF_INT1_Pos)

#define IRQMUX_IRQ16_SRC_INT0_Pos	0
#define IRQMUX_IRQ16_SRC_INT0_Msk	(0x1F << IRQMUX_IRQ16_SRC_INT0_Pos)
#define IRQMUX_IRQ16_SRC_INT1_Pos	5
#define IRQMUX_IRQ16_SRC_INT1_Msk	(0x1F << IRQMUX_IRQ16_SRC_INT1_Pos)

#define IRQMUX_IRQ17_SRC_INT0_Pos	0
#define IRQMUX_IRQ17_SRC_INT0_Msk	(0x1F << IRQMUX_IRQ17_SRC_INT0_Pos)
#define IRQMUX_IRQ17_SRC_INT1_Pos	5
#define IRQMUX_IRQ17_SRC_INT1_Msk	(0x1F << IRQMUX_IRQ17_SRC_INT1_Pos)

#define IRQMUX_IRQ18_SRC_INT0_Pos	0
#define IRQMUX_IRQ18_SRC_INT0_Msk	(0x1F << IRQMUX_IRQ18_SRC_INT0_Pos)
#define IRQMUX_IRQ18_SRC_INT1_Pos	5
#define IRQMUX_IRQ18_SRC_INT1_Msk	(0x1F << IRQMUX_IRQ18_SRC_INT1_Pos)

#define IRQMUX_IRQ19_SRC_INT0_Pos	0
#define IRQMUX_IRQ19_SRC_INT0_Msk	(0x1F << IRQMUX_IRQ19_SRC_INT0_Pos)
#define IRQMUX_IRQ19_SRC_INT1_Pos	5
#define IRQMUX_IRQ19_SRC_INT1_Msk	(0x1F << IRQMUX_IRQ19_SRC_INT1_Pos)

#define IRQMUX_IRQ20_SRC_INT0_Pos	0
#define IRQMUX_IRQ20_SRC_INT0_Msk	(0x1F << IRQMUX_IRQ20_SRC_INT0_Pos)
#define IRQMUX_IRQ20_SRC_INT1_Pos	5
#define IRQMUX_IRQ20_SRC_INT1_Msk	(0x1F << IRQMUX_IRQ20_SRC_INT1_Pos)

#define IRQMUX_IRQ21_SRC_INT0_Pos	0
#define IRQMUX_IRQ21_SRC_INT0_Msk	(0x1F << IRQMUX_IRQ21_SRC_INT0_Pos)
#define IRQMUX_IRQ21_SRC_INT1_Pos	5
#define IRQMUX_IRQ21_SRC_INT1_Msk	(0x1F << IRQMUX_IRQ21_SRC_INT1_Pos)

#define IRQMUX_IRQ22_SRC_INT0_Pos	0
#define IRQMUX_IRQ22_SRC_INT0_Msk	(0x1F << IRQMUX_IRQ22_SRC_INT0_Pos)
#define IRQMUX_IRQ22_SRC_INT1_Pos	5
#define IRQMUX_IRQ22_SRC_INT1_Msk	(0x1F << IRQMUX_IRQ22_SRC_INT1_Pos)

#define IRQMUX_IRQ23_SRC_INT0_Pos	0
#define IRQMUX_IRQ23_SRC_INT0_Msk	(0x1F << IRQMUX_IRQ23_SRC_INT0_Pos)
#define IRQMUX_IRQ23_SRC_INT1_Pos	5
#define IRQMUX_IRQ23_SRC_INT1_Msk	(0x1F << IRQMUX_IRQ23_SRC_INT1_Pos)

#define IRQMUX_IRQ24_SRC_INT0_Pos	0
#define IRQMUX_IRQ24_SRC_INT0_Msk	(0x1F << IRQMUX_IRQ24_SRC_INT0_Pos)
#define IRQMUX_IRQ24_SRC_INT1_Pos	5
#define IRQMUX_IRQ24_SRC_INT1_Msk	(0x1F << IRQMUX_IRQ24_SRC_INT1_Pos)

#define IRQMUX_IRQ25_SRC_INT0_Pos	0
#define IRQMUX_IRQ25_SRC_INT0_Msk	(0x1F << IRQMUX_IRQ25_SRC_INT0_Pos)
#define IRQMUX_IRQ25_SRC_INT1_Pos	5
#define IRQMUX_IRQ25_SRC_INT1_Msk	(0x1F << IRQMUX_IRQ25_SRC_INT1_Pos)

#define IRQMUX_IRQ26_SRC_INT0_Pos	0
#define IRQMUX_IRQ26_SRC_INT0_Msk	(0x1F << IRQMUX_IRQ26_SRC_INT0_Pos)
#define IRQMUX_IRQ26_SRC_INT1_Pos	5
#define IRQMUX_IRQ26_SRC_INT1_Msk	(0x1F << IRQMUX_IRQ26_SRC_INT1_Pos)

#define IRQMUX_IRQ27_SRC_INT0_Pos	0
#define IRQMUX_IRQ27_SRC_INT0_Msk	(0x1F << IRQMUX_IRQ27_SRC_INT0_Pos)
#define IRQMUX_IRQ27_SRC_INT1_Pos	5
#define IRQMUX_IRQ27_SRC_INT1_Msk	(0x1F << IRQMUX_IRQ27_SRC_INT1_Pos)

#define IRQMUX_IRQ28_SRC_INT0_Pos	0
#define IRQMUX_IRQ28_SRC_INT0_Msk	(0x1F << IRQMUX_IRQ28_SRC_INT0_Pos)
#define IRQMUX_IRQ28_SRC_INT1_Pos	5
#define IRQMUX_IRQ28_SRC_INT1_Msk	(0x1F << IRQMUX_IRQ28_SRC_INT1_Pos)

#define IRQMUX_IRQ29_SRC_INT0_Pos	0
#define IRQMUX_IRQ29_SRC_INT0_Msk	(0x1F << IRQMUX_IRQ29_SRC_INT0_Pos)
#define IRQMUX_IRQ29_SRC_INT1_Pos	5
#define IRQMUX_IRQ29_SRC_INT1_Msk	(0x1F << IRQMUX_IRQ29_SRC_INT1_Pos)

#define IRQMUX_IRQ30_SRC_INT0_Pos	0
#define IRQMUX_IRQ30_SRC_INT0_Msk	(0x1F << IRQMUX_IRQ30_SRC_INT0_Pos)
#define IRQMUX_IRQ30_SRC_INT1_Pos	5
#define IRQMUX_IRQ30_SRC_INT1_Msk	(0x1F << IRQMUX_IRQ30_SRC_INT1_Pos)

#define IRQMUX_IRQ31_SRC_INT0_Pos	0
#define IRQMUX_IRQ31_SRC_INT0_Msk	(0x1F << IRQMUX_IRQ31_SRC_INT0_Pos)
#define IRQMUX_IRQ31_SRC_INT1_Pos	5
#define IRQMUX_IRQ31_SRC_INT1_Msk	(0x1F << IRQMUX_IRQ31_SRC_INT1_Pos)

#define IRQMUX_GPIOA_IF_PIN0_Pos	0
#define IRQMUX_GPIOA_IF_PIN0_Msk	(0x01 << IRQMUX_GPIOA_IF_PIN0_Pos)
#define IRQMUX_GPIOA_IF_PIN1_Pos	1
#define IRQMUX_GPIOA_IF_PIN1_Msk	(0x01 << IRQMUX_GPIOA_IF_PIN1_Pos)
#define IRQMUX_GPIOA_IF_PIN2_Pos	2
#define IRQMUX_GPIOA_IF_PIN2_Msk	(0x01 << IRQMUX_GPIOA_IF_PIN2_Pos)
#define IRQMUX_GPIOA_IF_PIN3_Pos	3
#define IRQMUX_GPIOA_IF_PIN3_Msk	(0x01 << IRQMUX_GPIOA_IF_PIN3_Pos)
#define IRQMUX_GPIOA_IF_PIN4_Pos	4
#define IRQMUX_GPIOA_IF_PIN4_Msk	(0x01 << IRQMUX_GPIOA_IF_PIN4_Pos)
#define IRQMUX_GPIOA_IF_PIN5_Pos	5
#define IRQMUX_GPIOA_IF_PIN5_Msk	(0x01 << IRQMUX_GPIOA_IF_PIN5_Pos)
#define IRQMUX_GPIOA_IF_PIN6_Pos	6
#define IRQMUX_GPIOA_IF_PIN6_Msk	(0x01 << IRQMUX_GPIOA_IF_PIN6_Pos)
#define IRQMUX_GPIOA_IF_PIN7_Pos	7
#define IRQMUX_GPIOA_IF_PIN7_Msk	(0x01 << IRQMUX_GPIOA_IF_PIN7_Pos)
#define IRQMUX_GPIOA_IF_PIN8_Pos	8
#define IRQMUX_GPIOA_IF_PIN8_Msk	(0x01 << IRQMUX_GPIOA_IF_PIN8_Pos)
#define IRQMUX_GPIOA_IF_PIN9_Pos	9
#define IRQMUX_GPIOA_IF_PIN9_Msk	(0x01 << IRQMUX_GPIOA_IF_PIN9_Pos)
#define IRQMUX_GPIOA_IF_PIN10_Pos	10
#define IRQMUX_GPIOA_IF_PIN10_Msk	(0x01 << IRQMUX_GPIOA_IF_PIN10_Pos)
#define IRQMUX_GPIOA_IF_PIN11_Pos	11
#define IRQMUX_GPIOA_IF_PIN11_Msk	(0x01 << IRQMUX_GPIOA_IF_PIN11_Pos)
#define IRQMUX_GPIOA_IF_PIN12_Pos	12
#define IRQMUX_GPIOA_IF_PIN12_Msk	(0x01 << IRQMUX_GPIOA_IF_PIN12_Pos)
#define IRQMUX_GPIOA_IF_PIN13_Pos	13
#define IRQMUX_GPIOA_IF_PIN13_Msk	(0x01 << IRQMUX_GPIOA_IF_PIN13_Pos)
#define IRQMUX_GPIOA_IF_PIN14_Pos	14
#define IRQMUX_GPIOA_IF_PIN14_Msk	(0x01 << IRQMUX_GPIOA_IF_PIN14_Pos)
#define IRQMUX_GPIOA_IF_PIN15_Pos	15
#define IRQMUX_GPIOA_IF_PIN15_Msk	(0x01 << IRQMUX_GPIOA_IF_PIN15_Pos)

